---
kind: method
id: M:Autodesk.Revit.DB.Element.GetValidTypes
zh: 构件、图元、元素
source: html/086554ba-3c70-9c0f-8a09-55a4da4ef905.htm
---
# Autodesk.Revit.DB.Element.GetValidTypes Method

**中文**: 构件、图元、元素

Obtains a set of types that are valid for this element.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetValidTypes()
```

## Returns
A set of element IDs of types that are valid for this element or an empty set if element cannot have type assigned.